design/Timers.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Timers</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-10 19:04:44 EET"/>
<meta name="author" content="K."/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/style.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="./css/style.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Timers</h1>



<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Timeout </h2>
<div class="outline-text-2" id="text-1">

<p>  Used in networking code. Designed to signal when setain event does not 
  happen in predefined window of time.
</p>
<pre class="example">
see src/testing/timerTest.c
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">TTI Timeout </h2>
<div class="outline-text-2" id="text-2">

<p>  Used by MAC/RLC code. Time tick is driven by TTI triger from PHY. 
  Timer design is simplified version of linux timers. It reuses timer<sub>list</sub> struct
  and most of initialization code. 
</p>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Timers </h2>
<div class="outline-text-2" id="text-3">

<p>  Actual timers which expectet to run with a specified latency and sequence.
</p>
<pre class="example">
see ktime_t
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-10 19:04:44 EET</p>
<p class="author">Author: K.</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
